# pandas cookbook

In [1]:
import pandas as pd
import numpy as np
import pandas as pd
pd.options.display.latex.repr = True

## option设置

In [2]:
pd.set_option("display.max_rows",200)
pd.set_option("display.max_colwidth",500)
pd.set_option("display.precision",4) # 设置浮点数显示精度
pd.set_option("display.float_format",'{:,}'.format)
pd.set_option("display.float_format",'{:,.4f}'.format)
# pd.set_option('plotting.backend','plotly')

## 基本操作

### 查看基本数据

*  Sum of values in a data frame

df['金额'].sum()

* Lowest value of a data frame

df.min()

*  Highest value

df.max()

* Index of the lowest value

df.idxmin()

* Index of the highest value

df.idxmax()

*  Statistical summary of the data frame, with quartiles, median, etc.

df.describe(percentiles=[0.2,0.9,0.95])

* Average values

df.mean()

* Median values

df.median()

* Correlation between columns

df.corr()

*  To get these values for only one column, just select it like this#

df["size"].median()

In [3]:
d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
x  =pd.DataFrame(d)
print(x.shape)# 数据的形状
print(x.dtypes) #数据的类型
print(x.index.tolist()) #数据的索引
print(x.columns.tolist()) #数据的列名
print(x.describe()) #查看数据的详细信息
print(x.head()) # 展示数据前5行
print(x.tail()) #展示数据的后5行
print(x.info())

(6, 3)
A    int64
B    int64
C    int64
dtype: object
[0, 1, 2, 3, 4, 5]
['A', 'B', 'C']
           A      B      C
count 6.0000 6.0000 6.0000
mean  5.6667 3.1667 4.0000
std   2.3381 3.1252 3.0332
min   3.0000 0.0000 0.0000
25%   3.7500 0.5000 2.2500
50%   6.0000 3.0000 3.5000
75%   6.7500 4.7500 6.2500
max   9.0000 8.0000 8.0000
   A  B  C
0  3  2  2
1  3  4  4
2  6  5  3
3  6  8  8
4  7  0  7
   A  B  C
1  3  4  4
2  6  5  3
3  6  8  8
4  7  0  7
5  9  0  0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      int64
 1   B       6 non-null      int64
 2   C       6 non-null      int64
dtypes: int64(3)
memory usage: 272.0 bytes
None

In [4]:
print(x['A'].sum())
print(x['A'].value_counts())

34
6    2
3    2
7    1
9    1
Name: A, dtype: int64

### 选择多列数据

In [5]:
d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
pf = pd.DataFrame(d)
data = pf[['A','C']]
data

   A  C
0  3  2
1  3  4
2  6  3
3  6  8
4  7  7
5  9  0

### 选择多行数据

In [6]:
d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
pf = pd.DataFrame(d)
data = pf[['A','C']]
data

   A  C
0  3  2
1  3  4
2  6  3
3  6  8
4  7  7
5  9  0

### 选择指定值的数据

*  选取等于某些值的行记录 用 ==

df.loc[df['column_name'] == some_value]

* 选取某列是否是某一类型的数值 用 isin

df.loc[df['column_name'].isin([some_values,])]

* 多种条件的选取 用 &

df.loc[(df['column'] == some_value) & df['other_column'].isin(some_values)]

* 选取不等于某些值的行记录 用 ！=

df.loc[df['column_name'] != some_value]

* isin返回一系列的数值,如果要选择不符合这个条件的数值使用~

df.loc[~df['column_name'].isin(some_values)]

In [7]:
d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
pf = pd.DataFrame(d)
data = pf[(pf['A']==3) & (pf['B']==4) ]
print(data)
print("\n", pf.loc[pf['A'] == 9])
print("\n", pf.loc[pf['A'].isin([3])])
print("\n", pf.loc[~pf['A'].isin([3])])

   A  B  C
1  3  4  4

    A  B  C
5  9  0  0

    A  B  C
0  3  2  2
1  3  4  4

    A  B  C
2  6  5  3
3  6  8  8
4  7  0  7
5  9  0  0

### 对列求和和对行求和

* 对行求和  

- [ ] df['sum'] = df.apply(lambda x: x.sum(), axis=1)

* 对列进行求和

- [ ] df['A'].sum()
- [ ] pf[['A','B','C']].sum()
- [ ] pf.apply(lambda x: x.sum(), axis=0)

In [8]:
d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
pf = pd.DataFrame(d)

pf['D'] = pf.apply(lambda x: x.sum(), axis=1)
print(pf)

   A  B  C   D
0  3  2  2   7
1  3  4  4  11
2  6  5  3  14
3  6  8  8  22
4  7  0  7  14
5  9  0  0   9

In [9]:
d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
pf = pd.DataFrame(d)
pf[['A','B','C']].sum()
pf['Col_sum']= pf.apply(lambda x: x.sum(), axis=1)  #新增加一列
pf.loc['Row_sum'] = pf.apply(lambda x: x.sum()) #新增加一行
pf

          A   B   C  Col_sum
0         3   2   2        7
1         3   4   4       11
2         6   5   3       14
3         6   8   8       22
4         7   0   7       14
5         9   0   0        9
Row_sum  34  19  24       77

### 删除多列数据

In [10]:
def drop_multiple_col(col_names_list, df): 
    '''
    AIM    -> Drop multiple columns based on their column names 

    INPUT  -> List of column names, df

    OUTPUT -> updated df with dropped columns 
    ------
    '''
    df.drop(col_names_list, axis=1, inplace=True)
    return df

d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
x  =pd.DataFrame(d)
drop_multiple_col(['A','C'],x)
print(x)
print(x.columns.tolist())

   B
0  2
1  4
2  5
3  8
4  0
5  0
['B']

### 删除多行数据

In [11]:
def drop_multiple_index(index, df): 
    '''
    AIM    -> Drop multiple columns based on their column names 

    INPUT  -> List of column names, df

    OUTPUT -> updated df with dropped columns 
    ------
    '''
    df.drop(index, inplace=True)
    return df

d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
x  =pd.DataFrame(d)
drop_multiple_index([0,2,3],x)  
print(x)
print("drop after index:",x.index.values)

x.reset_index(drop=True, inplace=True) #重置原索引
print("reset_index:", x.index.values)

   A  B  C
1  3  4  4
4  7  0  7
5  9  0  0
drop after index: [1 4 5]
reset_index: [0 1 2]

### 删除缺少的数据

In [12]:
x.dropna(axis=0, how='any')

   A  B  C
0  3  4  4
1  7  0  7
2  9  0  0

### 数据类型转换 Dtypes

In [13]:
def change_dtypes(col_int, col_float, df): 
    '''
    AIM    -> Changing dtypes to save memory

    INPUT  -> List of column names (int, float), df

    OUTPUT -> updated df with smaller memory  
    ------
    '''
    df[col_int] = df[col_int].astype('int32')
    df[col_float] = df[col_float].astype('float32')

change_dtypes('A','B', x)
print(x.dtypes)

A      int32
B    float32
C      int64
dtype: object

###  将分类变量转换为数值变量

In [14]:
def convert_cat2num(df):
    # Convert categorical variable to numerical variable
    num_encode = {'col_1' : {'YES':1, 'NO':0},
                  'col_2'  : {'WON':1, 'LOSE':0, 'DRAW':0}}  
    df.replace(num_encode, inplace=True) 
    
d = {'col_1': ['YES', 'YES', 'NO', 'NO', 'NO', 'NO'], 'col_2': ['WON', 'LOSE', 'DRAW',  'LOSE', 'DRAW','WON'],'C': [2,4, 3, 8, 7, 0]}
data =pd.DataFrame(d)
convert_cat2num(data)
data

   col_1  col_2  C
0      1      1  2
1      1      0  4
2      0      0  3
3      0      0  8
4      0      0  7
5      0      1  0

### 检查缺失的数据 &&检查是否有空值

In [15]:
def check_missing_data(df):
    # check for any missing data in the df (display in descending order)
    return df.isnull().sum().sort_values(ascending=False)

d = {'col_1': [None, 'YES', 'NO', 'NO',None,None], 'col_2': ['WON', None, 'DRAW',  'LOSE', 'DRAW','WON'],'C': [2,4, 3, None, 7, 0]}
df =pd.DataFrame(d)
print(check_missing_data(df))

col_1    3
C        1
col_2    1
dtype: int64

In [16]:
print(df.dtypes)

col_1     object
col_2     object
C        float64
dtype: object

#### 类型自动转换

In [17]:
print(df.convert_dtypes().dtypes)

col_1    string
col_2    string
C         Int64
dtype: object

### 删除列中的字符串

In [18]:
def remove_col_str(df):
    # remove a portion of string in a dataframe column - col_1
    df['col_1'].replace('\n', '', regex=True, inplace=True)

    # remove all the characters after &# (including &#) for column - col_1
    df['col_1'].replace(' &#.*', '', regex=True, inplace=True)

d = {'col_1': [None, 'YES', 'NO', 'NO',None,None], 'col_2': ['WON', None, 'DRAW',  'LOSE', 'DRAW','WON'],'C': [2,4, 3, None, 7, 0]}
df =pd.DataFrame(d)
remove_col_str(df)
df

  col_1 col_2      C
0  None   WON 2.0000
1   YES  None 4.0000
2    NO  DRAW 3.0000
3    NO  LOSE    nan
4  None  DRAW 7.0000
5  None   WON 0.0000

### 判断某一列的值缺失情况

In [19]:
print(df.isnull().sum())

col_1    3
col_2    1
C        1
dtype: int64

In [20]:
def remove_col_white_space(df):
    # remove white space at the beginning of string 
    df[col] = df[col].str.lstrip().rstrip()
d = {'col_1': [None, 'YES  ', 'NO', 'NO',None,None], 'col_2': ['WON', None, 'DRAW',  ' LOSE', ' DRAW','WON'],'C': [2,4, 3, None, 7, 0]}
df =pd.DataFrame(d)
remove_col_str(df)
df

   col_1  col_2      C
0   None    WON 2.0000
1  YES     None 4.0000
2     NO   DRAW 3.0000
3     NO   LOSE    nan
4   None   DRAW 7.0000
5   None    WON 0.0000

### 将两列字符串数据（在一定条件下）拼接起来

In [21]:
d = {'col_1': ['YES', 'YES', 'NO', 'NO', 'NO', 'NO'], 'col_2': ['WON', 'LOSE', 'DRAW',  'LOSE', 'DRAW','WON'],'C': [2,4, 3, 8, 7, 0]}
df =pd.DataFrame(d)
df['col_1'] = df["col_1"].str.cat(df["col_2"],sep="-")
print("results:\n",df)

print("多个列进行拼接:\n", df['col_2'].str.cat([df['C'].astype("str"), df['col_2']],sep="-"))
df

results:
       col_1 col_2  C
0   YES-WON   WON  2
1  YES-LOSE  LOSE  4
2   NO-DRAW  DRAW  3
3   NO-LOSE  LOSE  8
4   NO-DRAW  DRAW  7
5    NO-WON   WON  0
多个列进行拼接:
 0      WON-2-WON
1    LOSE-4-LOSE
2    DRAW-3-DRAW
3    LOSE-8-LOSE
4    DRAW-7-DRAW
5      WON-0-WON
Name: col_2, dtype: object

      col_1 col_2  C
0   YES-WON   WON  2
1  YES-LOSE  LOSE  4
2   NO-DRAW  DRAW  3
3   NO-LOSE  LOSE  8
4   NO-DRAW  DRAW  7
5    NO-WON   WON  0

### 插入一行数据
* df.loc[index] 实现添加一行数据
* df.append() 实现添加一行数据

In [22]:
df = pd.DataFrame(columns=('lib', 'qty1', 'qty2'))#生成空的pandas表
for i in range(5):#插入一行<span id="transmark" style="display:none;"></span>
    df.loc[len(df)] = [np.random.randint(-1,1) for n in range(3)]
print("df.loc[index]:\n", df)


from numpy.random import randint
df = df.append({'lib':randint(-1,1), 'qty1':randint(-1,1), 'qty2':randint(-1,1)}, ignore_index=True)

print("df.append:\n", df)

df.loc[index]:
   lib qty1 qty2
0   0    0    0
1  -1    0    0
2   0   -1    0
3   0    0   -1
4  -1   -1   -1
df.append:
   lib qty1 qty2
0   0    0    0
1  -1    0    0
2   0   -1    0
3   0    0   -1
4  -1   -1   -1
5  -1   -1    0

### 插入一列或者多列数据

* 利用pd.concat 在DataFrame后面添加两列，这种方法的缺点是不能指定位置 pd.concat([df, pd.DataFrame(columns=list('DE'))])
* 利用 reindex来重排和增加列名df.reindex(columns=list('ABCDE'))

In [23]:
pd.concat([df, pd.DataFrame(columns=list('DE'))])

  lib qty1 qty2    D    E
0   0    0    0  NaN  NaN
1  -1    0    0  NaN  NaN
2   0   -1    0  NaN  NaN
3   0    0   -1  NaN  NaN
4  -1   -1   -1  NaN  NaN
5  -1   -1    0  NaN  NaN

In [24]:
df.reindex(columns=['lib', 'qty1', 'qty2','C','D'],fill_value=0)

  lib qty1 qty2  C  D
0   0    0    0  0  0
1  -1    0    0  0  0
2   0   -1    0  0  0
3   0    0   -1  0  0
4  -1   -1   -1  0  0
5  -1   -1    0  0  0

### 将字符串转换为时间戳

In [25]:
def convert_str_datetime(df): 
    '''
    AIM    -> Convert datetime(String) to datetime(format we want)

    INPUT  -> df

    OUTPUT -> updated df with new datetime format 
    ------
    '''
    df.insert(loc=2, column='timestamp', value=pd.to_datetime(df.transdate, format='%Y-%m-%d %H:%M:%S.%f'))

In [26]:
# # %matplotlib inline
# # %config InlineBackend.figure_format = 'retina'
# # import matplotlib.pyplot as plt
# # import pandas as pd
# # import numpy as np
# # plt.style.use('ggplot')
# # path = 'https://raw.githubusercontent.com/HoijanLai/dataset/master/PoliceKillingsUS.csv'
# # data = pd.read_csv(path, encoding ='latin1')
# # data.sample(3)
# data.groupby(by=['race'])['age'].mean()
# data.groupby('race')['signs_of_mental_illness'].value_counts()
# data.groupby('race')['signs_of_mental_illness'].value_counts().unstack()
# races = np.sort(data['race'].dropna().unique())
# fig, axes = plt.subplots(1, len(races), figsize=(24, 4), sharey=True)
# for ax, race in zip(axes, races):
#     data[data['race']==race]['flee'].value_counts().sort_index().plot(kind='bar', ax=ax, title=race)

## 排序

### 对指定的类进行排序

In [27]:
d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
x  =pd.DataFrame(d)
x.sort_values(by=['A'], ascending=[False])

   A  B  C
5  9  0  0
4  7  0  7
2  6  5  3
3  6  8  8
0  3  2  2
1  3  4  4

### 对多个列进行排序

In [28]:
d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
x  =pd.DataFrame(d)
x.sort_values(by=['A','B'], ascending=[False,False])

   A  B  C
5  9  0  0
4  7  0  7
3  6  8  8
2  6  5  3
1  3  4  4
0  3  2  2

## 聚合函数

### groupby函数

In [29]:
import pandas as pd

d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
x  =pd.DataFrame(d)
x.groupby(by=['A']).mean()

       B      C
A
3 3.0000 3.0000
6 6.5000 5.5000
7 0.0000 7.0000
9 0.0000 0.0000

In [30]:
x.groupby(by=['A']).mean().reset_index()

   A      B      C
0  3 3.0000 3.0000
1  6 6.5000 5.5000
2  7 0.0000 7.0000
3  9 0.0000 0.0000

### explode用于将一行数据展开成多行

In [31]:
id = ['a','b','c']
measurement = [4,6,[2,3,8]]
day = [1,1,1]
df = pd.DataFrame({'id':id, 'measurement':measurement, 'day':day})
df

  id measurement  day
0  a           4    1
1  b           6    1
2  c   [2, 3, 8]    1

In [32]:
df.explode('measurement').reset_index(drop=True)

  id measurement  day
0  a           4    1
1  b           6    1
2  c           2    1
3  c           3    1
4  c           8    1

### Nunique 用于计算行或列上唯一值的数量，即去重后计数

* Series.nunique(dropna=True)

* DataFrame.nunique(axis=0, dropna=True)
    
- [ ] axis：int型，0代表行，1代表列，默认0；
- [ ] dropna：bool类型，默认为True，计数中不包括NaN；

In [33]:
id = ['a','b','c']
measurement = [4,6,4]
day = [1,1,1]
df = pd.DataFrame({'id':id, 'measurement':measurement, 'day':day})
print(df.nunique(axis=0, dropna=True))
print("measurement:",df.measurement.nunique())

id             3
measurement    2
day            1
dtype: int64
measurement: 2

### infer_objects 直接将df或者series推断为合适的数据类型
* DataFrame.infer_objects()

In [34]:
df = pd.DataFrame({"A": ["a", 1, 2, 3]})
df = df.iloc[1:]
print(df.dtypes, "\n",df.infer_objects().dtypes)

A    object
dtype: object
 A    int64
dtype: object

### replace函数

In [35]:
values_1 = np.random.randint(10, size=10)
values_2 = np.random.randint(10, size=10)
years = np.arange(2010,2020)
groups = ['A','A','B','A','B','B','C','A','C','C']
df = pd.DataFrame({'group':groups, 'year':years, 'value_1':values_1, 'value_2':values_2})

df.replace('A','D') #将A全部替换为D：
df.replace({'B':'E','C':'F'}) #将B替换为E，C替换为F：

  group  year  value_1  value_2
0     A  2010        8        4
1     A  2011        1        3
2     E  2012        1        2
3     A  2013        9        6
4     E  2014        6        7
5     E  2015        9        9
6     F  2016        5        7
7     A  2017        6        2
8     F  2018        8        9
9     F  2019        2        2

### memory_usage函数

In [36]:
print(df.memory_usage())

Index      128
group       80
year        80
value_1     80
value_2     80
dtype: int64

### 重新命名列

In [37]:
df.rename(columns = {df.columns[2]:'size'}, inplace=True)
df

  group  year  size  value_2
0     A  2010     8        4
1     A  2011     1        3
2     B  2012     1        2
3     A  2013     9        6
4     B  2014     6        7
5     B  2015     9        9
6     C  2016     5        7
7     A  2017     6        2
8     C  2018     8        9
9     C  2019     2        2

### 保存和读取csv文件
* pd.to_csv("xxxx.csv", index=False)
* pd.read_csv("xxx.csv")

In [38]:
import pandas as pd

store = pd.HDFStore('demo.h5')
'''查看store类型'''
print(store)

<class 'pandas.io.pytables.HDFStore'>
File path: demo.h5

In [39]:
import numpy as np

#创建一个series对象
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

#创建一个dataframe对象
df = pd.DataFrame(np.random.randn(8, 3),
                 columns=['A', 'B', 'C'])

#插入键值
store['s'], store['df'] = s, df  #利用键值对将不同的数据存入store对象中
# store.put(key='s', value=s);store.put(key='df', value=df)  #使用put()方法将数据存入store对象中：

# 删除对应的键值
# store.remove('s') 
# del store['s']  

store.items

<bound method HDFStore.items of <class 'pandas.io.pytables.HDFStore'>
File path: demo.h5
>

In [40]:
store['df']

        A       B       C
0 -1.2247  0.8271 -1.1026
1  0.8727 -1.0258 -0.9528
2 -0.4357 -0.1756 -0.1271
3 -0.2360  1.3166 -0.3661
4  0.1212 -1.6702  1.6300
5  1.9009 -0.4757  1.6330
6  0.1357 -0.7323 -0.6285
7  0.5944  0.4827 -0.1210

### 保存到hdf5文件中

In [41]:
#创建新的数据框
df_ = pd.DataFrame(np.random.randn(5,5))
#导出到已存在的h5文件中，这里需要指定key
df_.to_hdf(path_or_buf='demo.h5',key='df_')
#创建于本地demo.h5进行IO连接的store对象
store = pd.HDFStore('demo.h5')
#查看指定h5对象中的所有键
print(store.keys())

['/df', '/df_', '/s']

### 读取hdf5文件

In [42]:
store = pd.HDFStore('demo.h5')

'''方式1'''
df1 = store['df']
'''方式2'''
df2 = store.get('df')

### hdf5 vs csv性能比较

In [43]:
import pandas as pd
import numpy as np
import time

store = pd.HDFStore('store.h5')
#生成一个1亿行，5列的标准正态分布随机数表
df = pd.DataFrame(np.random.rand(1000000,5))
start1 = time.time()
store['df'] = df
store.close()
print(f'HDF5存储用时{time.time()-start1}秒')
start2 = time.time()
df.to_csv('df.csv',index=False)
print(f'csv存储用时{time.time()-start2}秒')

HDF5存储用时0.04043245315551758秒
csv存储用时5.065668821334839秒

## 常用函数

### 计算变量缺失率

In [44]:
# 如果需要计算样本的缺失率分布，只要加上参数axis=1.
def missing_cal(df):
    """
    df :数据集
    
    return：每个变量的缺失率
    """
    missing_series = df.isnull().sum()/df.shape[0]
    missing_df = pd.DataFrame(missing_series).reset_index()
    missing_df = missing_df.rename(columns={'index':'col',
                                            0:'missing_pct'})
    missing_df = missing_df.sort_values('missing_pct',ascending=False).reset_index(drop=True)
    return missing_df

### 获取分组里最大值所在的行方法

In [45]:
df = pd.DataFrame({'Sp':['a','b','c','d','e','f'], 'Mt':['s1', 's1', 's2','s2','s2','s3'], 'Value':[1,2,3,4,5,6], 'Count':[3,2,5,10,10,6]})
df.iloc[df.groupby(['Mt']).apply(lambda x: x['Count'].idxmax())]


# 对ID进行分组之后再对分数应用rank函数，分数相同的情况会赋予相同的排名，然后取出排名为1的数据。
# df["rank"] = df.groupby("ID")["score"].rank(method="min", ascending=False).astype(np.int64)
# df[df["rank"] == 1][["ID", "class"]]

  Sp  Mt  Value  Count
0  a  s1      1      3
3  d  s2      4     10
5  f  s3      6      6

### 多列合并为一行

In [46]:
df = pd.DataFrame({'id_part':['a','b','c','d'], 'pred':[0.1,0.2,0.3,0.4], 'pred_class':['women','man','cat','dog'], 'v_id':['d1','d2','d3','d1']})
print(df)
df.groupby(['v_id']).agg({'pred_class': [', '.join],'pred': lambda x: list(x),
'id_part': 'first'}).reset_index()

  id_part   pred pred_class v_id
0       a 0.1000      women   d1
1       b 0.2000        man   d2
2       c 0.3000        cat   d3
3       d 0.4000        dog   d1

  v_id  pred_class        pred id_part
              join    <lambda>   first
0   d1  women, dog  [0.1, 0.4]       a
1   d2         man       [0.2]       b
2   d3         cat       [0.3]       c

### 删除包含特定字符串所在的行

In [47]:
df = pd.DataFrame({'a':[1,2,3,4], 'b':['s1', 'exp_s2', 's3','exps4'], 'c':[5,6,7,8], 'd':[3,2,5,10]})
df[df['b'].str.contains('exp')]

   a       b  c   d
1  2  exp_s2  6   2
3  4   exps4  8  10

### 组内排序

In [48]:
df = pd.DataFrame([['A',1],['A',3],['A',2],['B',5],['B',9]], columns = ['name','score'])
df

  name  score
0    A      1
1    A      3
2    A      2
3    B      5
4    B      9

In [49]:
df.sort_values(['name','score'], ascending = [True,False]) #方式1
df.groupby('name').apply(lambda x: x.sort_values('score', ascending=False)).reset_index(drop=True) #方式2

  name  score
0    A      3
1    A      2
2    A      1
3    B      9
4    B      5

### 选择特定类型的列

In [50]:
# # 选择所有数值型的列
# drinks.select_dtypes(include=['number']).head()
# # 选择所有字符型的列
# drinks.select_dtypes(include=['object']).head()
# drinks.select_dtypes(include=['number','object','category','datetime']).head()
# # 用 exclude 关键字排除指定的数据类型
# drinks.select_dtypes(exclude=['number']).head()

### 字符串转换为数值

In [51]:
# df = df.apply(pd.to_numeric, errors='coerce').fillna(0)

### 优化 DataFrame 对内存的占用

* 只读取切实所需的列，使用usecols参数
```
cols = ['beer_servings','continent']
small_drinks = pd.read_csv('data/drinks.csv', usecols=cols)

```
* 把包含类别型数据的 object 列转换为 Category 数据类型，通过指定 dtype 参数实现。

```
dtypes ={'continent':'category'}
smaller_drinks = pd.read_csv('data/drinks.csv',usecols=cols, dtype=dtypes)
```

### 根据最大的类别筛选 DataFrame

In [52]:
# movies = pd.read_csv('data/imdb_1000.csv')
# counts = movies.genre.value_counts()
# movies[movies.genre.isin(counts.nlargest(3).index)].head()

### 把字符串分割为多列

In [53]:
df = pd.DataFrame({'姓名':['张 三','李 四','王 五'],
                   '所在地':['北京-东城区','上海-黄浦区','广州-白云区']})
df
df.姓名.str.split(' ', expand=True)

   0  1
0  张  三
1  李  四
2  王  五

### 把 Series 里的列表转换为 DataFrame

In [54]:
import pandas as pd
df = pd.DataFrame({'列1':['a','b','c'],'列2':[[10,20], [20,30], [30,40]]})
df_new = df.列2.apply(pd.Series)
pd.concat([df,df_new], axis='columns')

  列1        列2   0   1
0  a  [10, 20]  10  20
1  b  [20, 30]  20  30
2  c  [30, 40]  30  40

### 用agg聚合多个函数

In [55]:
# orders = pd.read_csv('data/chipotle.tsv', sep='\t')
df.groupby('列1').agg(['sum','count']).head()

          列2
         sum count
列1
a   [10, 20]     1
b   [20, 30]     1
c   [30, 40]     1

In [56]:
df.groupby('列1').agg(lambda x:x.sum()).head()

          列2
列1
a   [10, 20]
b   [20, 30]
c   [30, 40]

#### 展示各个聚合函数的类名

In [57]:
df.groupby('列1').agg(my_sum=('列2',sum),my_count=('列2','count')).reset_index().head()

  列1    my_sum  my_count
0  a  [10, 20]         1
1  b  [20, 30]         1
2  c  [30, 40]         1

### apply聚合

In [58]:
import pandas as pd
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
    'key2':['one', 'two', 'one', 'two', 'one'],
    'data1':np.random.randn(5),
     'data2':np.random.randn(5)})

for name, group in df.groupby('key1'):
    print(name)
    print(group)

dict(list(df.groupby('key1')))

a
  key1 key2   data1   data2
0    a  one  0.6308 -0.0681
1    a  two -0.2080  1.0695
4    a  one -0.5082  0.6216
b
  key1 key2  data1  data2
2    b  one 2.4074 1.3328
3    b  two 0.8092 0.7968

{'a':   key1 key2   data1   data2
 0    a  one  0.6308 -0.0681
 1    a  two -0.2080  1.0695
 4    a  one -0.5082  0.6216,
 'b':   key1 key2  data1  data2
 2    b  one 2.4074 1.3328
 3    b  two 0.8092 0.7968}

In [59]:
### 通过字典或Series进行分组

people = pd.DataFrame(np.random.randn(5, 5),
     columns=['a', 'b', 'c', 'd', 'e'],
     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
mapping = {'a':'red', 'b':'red', 'c':'blue',
     'd':'blue', 'e':'red', 'f':'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

          blue     red
Joe     1.1649 -0.2985
Steve   0.1593  1.2084
Wes    -1.1313  2.8720
Jim    -0.0275 -0.4453
Travis -0.8839  0.2133

In [60]:
import pandas as pd

d = {'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
df  =pd.DataFrame(d)
df['A']= df["A"].apply(lambda height: 2 * height)
df

    A  B  C
0   6  2  2
1   6  4  4
2  12  5  3
3  12  8  8
4  14  0  7
5  18  0  0

In [61]:
def multiply(x):
    return x * 2

df['A']= df["A"].apply(multiply)
df

    A  B  C
0  12  2  2
1  12  4  4
2  24  5  3
3  24  8  8
4  28  0  7
5  36  0  0

### map函数

In [62]:
df["A"].map(multiply)
print(df["A"].map(lambda height: 2 * height))

0    24
1    24
2    48
3    48
4    56
5    72
Name: A, dtype: int64

##  Multiindex/Multicolumn应用

In [63]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', ],
          ['one', 'two', 'one', 'two', 'one', 'two', ]]

tuples = list(zip(*arrays))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 6), columns=arrays)
df

      bar             baz             foo
      one     two     one     two     one     two
0  1.6976 -0.1107 -0.3354 -0.8196 -0.7259  0.3386
1  0.3443  1.8214 -1.0245  0.3184 -0.3063 -0.0276
2  0.9060 -1.2698  0.2771 -1.1222 -0.3941 -0.8615
3 -1.7811 -0.1333 -0.4715 -0.1949 -0.1001 -1.2126
4 -0.6267  0.3543 -0.2652 -0.7798 -0.0951 -0.8104
5 -1.0869 -0.4640  0.3567  1.1992 -0.1225  0.3883
6 -0.4437 -1.3225 -0.0464  0.3306  0.7086  1.2082
7 -0.2411  0.2680  0.3658  0.1197  0.0161 -0.9733

In [64]:
df.loc[:, [('bar', 'one'), ('baz', 'two')]],df.loc[:, 'bar']

(      bar     baz
       one     two
 0  1.6976 -0.8196
 1  0.3443  0.3184
 2  0.9060 -1.1222
 3 -1.7811 -0.1949
 4 -0.6267 -0.7798
 5 -1.0869  1.1992
 6 -0.4437  0.3306
 7 -0.2411  0.1197,
       one     two
 0  1.6976 -0.1107
 1  0.3443  1.8214
 2  0.9060 -1.2698
 3 -1.7811 -0.1333
 4 -0.6267  0.3543
 5 -1.0869 -0.4640
 6 -0.4437 -1.3225
 7 -0.2411  0.2680)

In [65]:
df.loc[:, pd.IndexSlice[['bar','baz'], 'two']]

      bar     baz
      two     two
0 -0.1107 -0.8196
1  1.8214  0.3184
2 -1.2698 -1.1222
3 -0.1333 -0.1949
4  0.3543 -0.7798
5 -0.4640  1.1992
6 -1.3225  0.3306
7  0.2680  0.1197

In [66]:
# np.random.randint(0,100,size=(6,3)) 是使用numpy中的随机模块random中，生成随机整数方法randint，
# 里面的参数size是指定生成6行3列的数据，并且每个数字的范围在0到100之间。
da = np.random.randint(100,size=(6,3))
df = pd.DataFrame(da,index=[["a","a","b","b","c","c"],
                            ["期末","期中","期末","期中","期末","期中"]],
                   columns=["语文","英语","数学"])
df

      语文  英语  数学
a 期末  63  61  33
  期中  98  65  76
b 期末  65  22  43
  期中  26  70  66
c 期末  58  10  92
  期中  80  32  36

In [67]:
df.loc[['a','c']]

      语文  英语  数学
a 期末  63  61  33
  期中  98  65  76
c 期末  58  10  92
  期中  80  32  36

In [68]:
# Series
import numpy as np
names=["a","b","c"]
exems=["期中","期末"]
index=pd.MultiIndex.from_product([names,exems])
print(index)
df = pd.Series(np.random.randint(0,150,size=6),index=index)
print(df)

MultiIndex([('a', '期中'),
            ('a', '期末'),
            ('b', '期中'),
            ('b', '期末'),
            ('c', '期中'),
            ('c', '期末')],
           )
a  期中     98
   期末    142
b  期中    134
   期末    147
c  期中     44
   期末     28
dtype: int64

In [69]:
# 方法将普通列转成多层级索引
da = np.random.randint(100,size=(6,3))
dic = {"class":["class1","class1","class2","class3"],
      "name":["linda","mark","lily","cherich"],
      "score":[100,123,120,116]}
df3 = pd.DataFrame(dic)
print(df3)
df3.set_index(["class","name"])

    class     name  score
0  class1    linda    100
1  class1     mark    123
2  class2     lily    120
3  class3  cherich    116

                score
class  name
class1 linda      100
       mark       123
class2 lily       120
class3 cherich    116

In [70]:
df3.sort_index(level=0,ascending=False)

    class     name  score
3  class3  cherich    116
2  class2     lily    120
1  class1     mark    123
0  class1    linda    100

## 高级函数

In [71]:
import pandas as pd

id = ['a','b','c']
measurement = [4,6,[2,3,8]]
day = [1,1,1]
df1 = pd.DataFrame({'id':id, 'measurement':measurement, 'day':day})
df1

  id measurement  day
0  a           4    1
1  b           6    1
2  c   [2, 3, 8]    1

### explode 函数
* explode用于将一行数据展开成多行

In [72]:
zz = df1.explode('measurement').reset_index(drop=True)
zz

  id measurement  day
0  a           4    1
1  b           6    1
2  c           2    1
3  c           3    1
4  c           8    1

### Nunique函数
* Nunique用于计算行或列上唯一值的数量，即去重后计数。这个函数在分类问题中非常实用，当不知道某字段中有多少类元素时，Nunique能快速生成结果。


- [ ] Series.nunique(dropna=True)

- [ ] DataFrame.nunique(axis=0, dropna=True)


* axis：int型，0代表行，1代表列，默认0；
* dropna：bool类型，默认为True，计数中不包括NaN；

In [73]:
import numpy as np

values_1 = np.random.randint(10, size=10)
values_2 = np.random.randint(10, size=10)
years = np.arange(2010,2020)
groups = ['A','A','B','A','B','B','C','A','C','C']
df = pd.DataFrame({'group':groups, 'year':years, 'value_1':values_1, 'value_2':values_2})
df

  group  year  value_1  value_2
0     A  2010        5        8
1     A  2011        6        0
2     B  2012        8        7
3     A  2013        6        3
4     B  2014        1        0
5     B  2015        9        4
6     C  2016        2        1
7     A  2017        1        6
8     C  2018        0        6
9     C  2019        6        4

In [74]:
df.year.nunique()

10

In [75]:
print(df['group'].value_counts())

A    4
C    3
B    3
Name: group, dtype: int64

### infer_objects函数
* infer_objects用于将object类型列推断为更合适的数据类型

In [76]:
df = pd.DataFrame({"A": ["a", 1, 2, 3]})
df = df.loc[1:]
df

   A
1  1
2  2
3  3

In [77]:
df.infer_objects()

   A
1  1
2  2
3  3

### memory_usage函数
* memory_usage用于计算dataframe每一列的字节存储大小，这对于大数据表非常有用。参数解释：
* index：指定是否返回df中索引字节大小，默认为True，返回的第一行即是索引的内存使用情况；
* deep：如果为True，则通过查询object类型进行系统级内存消耗来深入地检查数据，并将其包括在返回值中。

In [78]:
df_large = pd.DataFrame({'A': np.random.randn(1000000),
                    'B': np.random.randint(100, size=1000000)})
df_large.shape, df_large.memory_usage()

((1000000, 2),
 Index        128
 A        8000000
 B        8000000
 dtype: int64)

## pipe函数
```
func(g(h(df), arg1=a), arg2=b, arg3=c)

(df.pipe(h)
...    .pipe(g, arg1=a)
...    .pipe(func, arg2=b, arg3=c)
... )
```

In [79]:
import numpy as np
import pandas as pd
df = pd.DataFrame({
 "id": [100, 100, 101, 102, 103, 104, 105, 106],
 "A": [1, 2, 3, 4, 5, 2, np.nan, 5],
 "B": [45, 56, 48, 47, 62, 112, 54, 49],
 "C": [1.2, 1.4, 1.1, 1.8, np.nan, 1.4, 1.6, 1.5]
})
df

    id      A    B      C
0  100 1.0000   45 1.2000
1  100 2.0000   56 1.4000
2  101 3.0000   48 1.1000
3  102 4.0000   47 1.8000
4  103 5.0000   62    nan
5  104 2.0000  112 1.4000
6  105    nan   54 1.6000
7  106 5.0000   49 1.5000

In [80]:
def fill_missing_values(df):
    for col in df.select_dtypes(include= ["int","float"]).columns:
        val = df[col].mean()
        df[col].fillna(val, inplace=True)
    return df
def drop_duplicates(df, column_name):
    df = df.drop_duplicates(subset=column_name)
    return df
def remove_outliers(df, column_list):
    for col in column_list:
        avg = df[col].mean()
        std = df[col].std()
        low = avg - 2 * std
        high = avg + 2 * std
        df = df[df[col].between(low, high, inclusive=True)]
    return df

df_processed = (
    df.pipe(fill_missing_values)
 .pipe(drop_duplicates, "id")
 .pipe(remove_outliers, ["A","B"])
)

In [81]:
df_processed

    id      A   B      C
0  100 1.0000  45 1.2000
2  101 3.0000  48 1.1000
3  102 4.0000  47 1.8000
4  103 5.0000  62 1.4286
6  105 3.1429  54 1.6000
7  106 5.0000  49 1.5000

## groupby应用&&输出格式化

In [82]:

import pandas as pd

d = {'姓名':[1,2,1,3,2,3], 'A': [3, 3,6, 6, 7, 9], 'B': [2,4, 5, 8, 0, 0],'C': [2,4, 3, 8, 7, 0]}
x  =pd.DataFrame(d)
x.groupby(by=['A']).mean()

      姓名      B      C
A
3 1.5000 3.0000 3.0000
6 2.0000 6.5000 5.5000
7 2.0000 0.0000 7.0000
9 3.0000 0.0000 0.0000

In [83]:
import numpy as np
y= x.groupby('A').agg({'B':[np.mean,min,max,pd.Series.nunique,sum]}).reset_index()
y

   A      B
       mean min max nunique sum
0  3 3.0000   2   4       2   6
1  6 6.5000   5   8       2  13
2  7 0.0000   0   0       1   0
3  9 0.0000   0   0       1   0

In [84]:
y.columns.names, y.columns.values

(FrozenList([None, None]),
 array([('A', ''), ('B', 'mean'), ('B', 'min'), ('B', 'max'),
        ('B', 'nunique'), ('B', 'sum')], dtype=object))

In [85]:
(x.groupby(by=['姓名']))['A'].agg(['mean','sum']).head(5).style.format('${0:,.2f}')

In [86]:
consumer_sales = x.groupby('姓名')['A'].agg(['sum']).reset_index()
consumer_sales['消费金额占比'] = consumer_sales['sum'] / consumer_sales['sum'].sum()
(consumer_sales.head(5)
              .style
              .format({'sum':'${0:,.0f}', '消费金额占比': '{:.2%}'}))

### 突出显示特殊值

In [87]:
#求每个月的销售总金额，并分别用红色、绿色高亮显示最大值和最小值
monthly_sales =x.groupby('姓名')['A'].agg(['sum']).reset_index()
monthly_sales['消费金额占比'] = consumer_sales['sum'] / consumer_sales['sum'].sum()

format_dict = {'sum':'${0:,.0f}',  '消费金额占比': '{:.2%}'}
(monthly_sales.style
              .format(format_dict)
              .highlight_max(color='#cd4f39')
              .highlight_min(color='lightgreen'))

In [88]:
import seaborn as sns

cm = sns.light_palette("green", as_cmap=True)

zz= (x.groupby(['姓名'])[['A','B']]
     .agg(['sum'])
     .head(5).reset_index()
     .style
     .background_gradient(cmap=cm))
zz

### 输出显示分布图

In [89]:
!pip install sparklines

Requirement already satisfied: sparklines in /home/xty/anaconda3/envs/speech/lib/python3.7/site-packages (0.4.2)
Requirement already satisfied: future in /home/xty/anaconda3/envs/speech/lib/python3.7/site-packages (from sparklines) (0.18.2)

In [90]:
from sparklines import sparklines
import numpy as np
# 定义sparklines函数用于展现数据分布
def sparkline_str(x):
    bins = np.histogram(x)[0]
    sl = ''.join(sparklines(bins))
    return sl

# 定义groupby之后的列名
sparkline_str.__name__ = "分布图"

x.groupby('姓名')[['A', 'B']].agg(['mean', sparkline_str])

        A                  B
     mean         分布图   mean         分布图
姓名
1  4.5000  █▁▁▁▁▁▁▁▁█ 3.5000  █▁▁▁▁▁▁▁▁█
2  5.0000  █▁▁▁▁▁▁▁▁█ 2.0000  █▁▁▁▁▁▁▁▁█
3  7.5000  █▁▁▁▁▁▁▁▁█ 4.0000  █▁▁▁▁▁▁▁▁█

In [91]:
x.sort_values("A").reset_index(inplace=True)
x.style.bar(subset=['A', 'B'], align='zero',color='#00B8EA')

## accessor函数

In [92]:
pd.Series._accessors

{'cat', 'dt', 'sparse', 'str'}

In [93]:
import numpy as np

values_1 = np.random.randint(10, size=10)
values_2 = np.random.randint(10, size=10)
years = np.arange(2010,2020)
groups = ['A','A','B','A','B','B','C','A','C','C']
df = pd.DataFrame({'group':groups, 'year':years, 'value_1':values_1, 'value_2':values_2})
df

  group  year  value_1  value_2
0     A  2010        3        3
1     A  2011        9        4
2     B  2012        2        9
3     A  2013        7        5
4     B  2014        7        9
5     B  2015        6        4
6     C  2016        8        7
7     A  2017        0        0
8     C  2018        0        9
9     C  2019        3        9

### str相关的函数

In [94]:
", ".join([i for i in dir(pd.Series.str) if not  i.startswith('_')])

'capitalize, casefold, cat, center, contains, count, decode, encode, endswith, extract, extractall, find, findall, fullmatch, get, get_dummies, index, isalnum, isalpha, isdecimal, isdigit, islower, isnumeric, isspace, istitle, isupper, join, len, ljust, lower, lstrip, match, normalize, pad, partition, repeat, replace, rfind, rindex, rjust, rpartition, rsplit, rstrip, slice, slice_replace, split, startswith, strip, swapcase, title, translate, upper, wrap, zfill'

In [95]:
", ".join([i for i in dir(pd.Series.dt) if not  i.startswith('_')])

'asfreq, ceil, components, date, day, day_name, dayofweek, dayofyear, days, days_in_month, daysinmonth, end_time, floor, freq, hour, is_leap_year, is_month_end, is_month_start, is_quarter_end, is_quarter_start, is_year_end, is_year_start, isocalendar, microsecond, microseconds, minute, month, month_name, nanosecond, nanoseconds, normalize, quarter, qyear, round, second, seconds, start_time, strftime, time, timetz, to_period, to_pydatetime, to_pytimedelta, to_timestamp, total_seconds, tz, tz_convert, tz_localize, week, weekday, weekofyear, year'

In [96]:
print(df['group'].str.lower())

0    a
1    a
2    b
3    a
4    b
5    b
6    c
7    a
8    c
9    c
Name: group, dtype: object